In [ ]:
import pandas as pd

url = pd.read_csv('https://raw.githubusercontent.com/fp-rap-build/data-science/main/data/raw_original.csv')

url.head()

    name         geoid  ... hhi_150k_to_1999k hhi_200k_or_more
0  83824  86000US83824  ...                 5                0
1  83851  86000US83851  ...                 8                2
2  83870  86000US83870  ...                 0                0
3  97031  86000US97031  ...               449              599
4  98001  86000US98001  ...              1214              826

[5 rows x 29 columns]

In [ ]:
data = url[['name', 'city_name', 'average_household_income']].copy()

In [ ]:
data = data.rename(columns={'name':'zipcode',})
data = data.rename(columns={'average_household_income':'average_annual_household_income',})

In [ ]:
data['average_monthly_household_income'] = data['average_annual_household_income'].div(12).round(2)

In [ ]:
small = data[['zipcode', 'city_name', 'average_monthly_household_income']].copy()

In [ ]:
small.sort_values(by=['average_monthly_household_income'],ascending=False).head(5)

    zipcode  ... average_monthly_household_income
34    98039  ...                         26932.50
35    98040  ...                         18718.25
53    98074  ...                         18487.83
55    98077  ...                         18485.25
87    98164  ...                         18302.25

[5 rows x 3 columns]

In [ ]:
small.sort_values(by=['average_monthly_household_income'],ascending=False).to_csv(r'small_clean.csv', index = False)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/fp-rap-build/data-science/main/data/cleaned_data.csv')
df.head()

   zipcode  ... average_monthly_household_income
0    98039  ...                            26933
1    98040  ...                            18718
2    98074  ...                            18488
3    98077  ...                            18485
4    98164  ...                            18302

[5 rows x 3 columns]

In [ ]:
df = df.rename(columns={'monthly_mean_income':'average_monthly_household_income',})

In [ ]:
df.describe()

            zipcode  average_monthly_household_income
count    571.000000                        571.000000
mean   98620.488616                       6989.611208
std      408.528005                       2769.527576
min    97031.000000                       1404.000000
25%    98280.500000                       5217.500000
50%    98581.000000                       6422.000000
75%    99002.000000                       7932.000000
max    99403.000000                      26933.000000

In [ ]:
df[(df['city_name'] == 'Spokane')]

     zipcode city_name  average_monthly_household_income
86     99203   Spokane                              9150
128    99223   Spokane                              8160
188    99026   Spokane                              7391
511    99204   Spokane                              4332
528    99207   Spokane                              4182
531    99201   Spokane                              4119